Revit 2024 API
ConceptualConstructionType.GetRoofConstructionType Method
 Get a Roof ConceptualConstructionType by its ConceptualConstructionRoofType.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static ElementId GetRoofConstructionType(
	Document ccda,
	ConceptualConstructionRoofType typeEnum
)
Visual Basic
Public Shared Function GetRoofConstructionType ( _
	ccda As Document, _
	typeEnum As ConceptualConstructionRoofType _
) As ElementId
Visual C++
public:
static ElementId^ GetRoofConstructionType(
	Document^ ccda,
	ConceptualConstructionRoofType typeEnum
)
Parameters
ccda
Type: Autodesk.Revit.DB.Document
 The Document.
typeEnum
Type: Autodesk.Revit.DB.Analysis.ConceptualConstructionRoofType
 The ConceptualConstructionRoofType to get the ConceptualConstructionType for.
Return Value
 Returns ElementId of a ConceptualConstructionType.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The enum is invalid for ConceptualConstructionRoofType. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
ConceptualConstructionType Class
Autodesk.Revit.DB.Analysis Namespace